---
kind: other
id: Properties.T:Autodesk.Revit.DB.RevisionSettings
source: html/792cff7f-af82-ccbb-511c-bbdc915d44d6.htm
---
# RevisionSettings Properties

The id of the assembly instance to which the element belongs.